{
  "id": "automating_webgl_canvas_based_website",
  "slug": "automating-webgl-canvas-based-website",
  "title": "Canvas Automation Testing: How to Automate WebGL-Based Websites",
  "excerpt": "WebGL-based websites are becoming increasingly popular among web developers looking to create immersive and interactive user experiences. By ....",
  "content": "<p id=\">WebGL-based websites are becoming increasingly popular among web developers looking to create immersive and interactive user experiences. By drawing graphics and animations directly on the canvas, they offer developers a high degree of creative control over the user interface, providing a more flexible and dynamic platform for graphical compositions. They also offer a more interactive user experience, allowing users to interact with graphics and animations in real-time, making canvas automation and testing critical for ensuring the website's functionality.</p><p id=\">However, WebGL-based websites also present a unique challenge for automation and testing, as they often lack DOM elements that conventional selector-based test frameworks rely on.</p><p id=\">In this tutorial, we will demonstrate a canvas automation case using AskUI to automate a WebGL-based website. Since Ask relies solely on what is visible on the screen, you will discover how easy it is to automate even such a canvas-based website without relying on any DOM element.</p><h2 id=\">Visit the Target Website</h2>\n\n<p id=\">For the demonstration, we will use the website below. First, visit this website. If you inspect the source of this website, you will discover that it consists of a single canvas element without giving any clue on how to programmatically automate user interaction.</p>\n\n<ul id=\"><li id=\"><a href=\"https://chartogne-taillet.com/en/\" id=\">https://chartogne-taillet.com</a></li></ul>\n\n<p id=\"><strong id=\">Disclaimer</strong>: We use this website merely for our demonstration purpose and don't intend to promote any product or brand from this website.</p><h2 id=\">Plan the Automation</h2>\n\n<p id=\">Our final goal of this automation is to visit a page of this website that gives detailed information about a certain grapevine. Below are the steps we will automate:</p>\n\n<ol id=\"><li id=\">Open the web browser and go to the website.</li><li id=\">Click <em id=\">Accept</em> for the cookie pop-up.</li><li id=\">Click the text <em id=\">Enter</em> on the first page.</li><li id=\">Click the text that is a certain sort of grapevine.</li><li id=\">Move the mouse cursor to the interaction point.</li><li id=\">Scroll the mouse wheel.</li></ol><h2 id=\">1. Visiting the Website</h2>\n\n<p id=\">The first step of the automation is to open the web browser and go to the website. Use the code below, and adjust the necessary part for your environment:</p><pre></pre><p id=\">After successfully running the code, we will see this page:</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:800px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"800px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b5206868b54db3ad9b_6437b3329cb0e18f5ed49986_webgl-first.jpeg\" loading=\"lazy\" id=\" width=\"auto\" height=\"auto\" alt=\"></div></figure><h2 id=\">2. Click Enter and go to Les Couarres</h2>\n\n<p id=\">Nextly, we will click the text <em id=\">Enter</em> and the page will transit to the next page. After that, we press the text <em id=\">Les Couarres</em> on the bottom right part of the page. Note that these texts are not DOM elements, but merely texts drawn on the canvas as a bitmap. So there is no clue how to interact with these text-buttons if you inspect the source HTML of the page. Add this code block to the end of the code:</p><pre></pre><p id=\">After running the code, we will be on this page:</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:800px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"800px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b5206868b54db3ad93_6437b3683ca99c2efd00df9b_webgl-second.jpeg\" loading=\"lazy\" id=\" width=\"auto\" height=\"auto\" alt=\"></div></figure><h2 id=\">3. Scroll on the Text</h2>\n\n<p id=\">Now we want to move on to the page where we can get detailed information about Les Couarres. To do so, we have to interact with the text <em id=\">DISCOVER</em> that is placed at the mid-bottom of the screen:</p><pre></pre><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:800px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"800px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b5206868b54db3ad97_6437b3905fa99b54af48d580_webgl-third.jpeg\" loading=\"lazy\" id=\" width=\"auto\" height=\"auto\" alt=\"></div></figure><p id=\">Try to adjust the amount of scrolling that suits your condition, for example, decrease it to -3000 if you have a high-resolution display. When scrolling on the text, you will see a smooth transition to another page. Clicking the text also triggers the same result, so give it a try if you want to!</p><p id=\">There will be an animation until the page transition gets done. And after the transition, we will be on a page about a certain vineyard and grapes.</p><p id=\">Congratulations! You just successfully automated mouse interactions with WebGL contents!</p><h2 id=\">Conclusion</h2>\n\n<p id=\">In this article, we demonstrated how to automate a WebGL-based website using AskUI. By relying solely on what is visible on the screen, AskUI can interact with canvas-based websites without requiring any selectors or tags. We walked through an automation/testing case to visit a certain page of a website, click on non-DOM text elements, move the mouse cursor toward a bitmap text, and scroll on a specific bitmap text, all of which are common challenges when automating WebGL-based and canvas-based websites. With AskUI, you can easily automate even the most complex canvas-based user interfaces, providing a more efficient way to test and validate the user experience of your WebGL applications.</p>",
  "category": "Tutorial",
  "readTime": "3 min read",
  "date": "2024-11-11",
  "publishedAt": "Mon Nov 11 2024 11:24:10 GMT+0000 (Coordinated Universal Time)",
  "author": "Ron Junior van Cann",
  "image": "https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b4206868b54db3ad81_6437b3ca2e0bd9f05f39562d_webgl-main.webp",
  "featured": false,
  "contentPath": "automating-webgl-canvas-based-website.md"
}