{
  "id": "automate_github_2_factor_authentication_with_andro",
  "slug": "automate-github-2-factor-authentication-with-android-device",
  "title": "Automate Github 2-Factor Authentication (2FA) with Android Device",
  "excerpt": "Today, we're building a two-factor authentication GitHub workflow automation with a browser we have on our Personal Computer (PC) and a physical A....",
  "content": "<p id=\">Today, we're building a two-factor authentication GitHub workflow automation with a browser we have on our Personal Computer (PC) and a physical Android device.</p><p id=\">Cross-Platform automation and within one framework is hard to do. That is why testing is often done by humans. This means it is expensive. Both in working hours and also for elaborate setups with multiple devices.</p><p id=\">We will show you a way to automate cross-platform based on visual selectors and Operating System (OS) automation (Clicks/Taps, mouse movement, keystrokes.). Getting you started on your journey to <strong id=\">real</strong> Cross-Platform UI Automation.</p><h2 id=\">Setup</h2>\n\n<p id=\">For the setup of this tutorial, we need to do two things:</p>\n\n<ul id=\"><li id=\">Set up your Android device</li><li id=\">Set up our GitHub account with the Android device as a second factor</li></ul><h2 id=\">Android Device</h2>\n\n<p id=\">We need to enable USB debugging, install the LastPass Authenticator app, and enable screenshots for it. So let's do that now.</p><h3 id=\">Lastpass Authenticator App</h3>\n\n<p id=\">You have to install the <a href=\"https://play.google.com/store/apps/details?id=com.lastpass.authenticator&hl=en_US&gl=US\" id=\">LastPass Authenticator app</a> from the Google Play Store.</p><h3 id=\">Enable Screenshots in the LastPass Authenticator App</h3>\n\n<p id=\">Open the app. Go to the settings of the LastPass Authenticator app and enable screenshots.</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:512px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"512px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b6dc3cb7acca94ea00_63c55aaf9f1b458352d5791d_9s9kzocg77ajdb3x6ftb.jpeg\" alt=\"LastPass Authenticator App settings screen with allow screenshots option enabled.\" id=\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h3 id=\">Enable USB Debugging</h3>\n\n<p id=\">Next, we have to enable USB debugging on the device. Depending on your Android version and the manufacturer of the device, this always is a little bit different. So I'll show you how it's done on my device.</p><p id=\">First, head over to the settings. Then find <em id=\">System</em> and scroll down to <em id=\">About the Tablet</em>. Then find the <strong id=\">Build Number</strong> and hit it seven times. A little pop-up on the bottom should show up which says: <strong id=\">You are now a Developer!</strong>. If it were always this easy to learn a new profession 😋</p><p id=\">Let's go back to <em id=\">System</em> and there should be a new option: <em id=\">Developer Options</em>. Tap it and scroll down to <strong id=\">USB debugging</strong>. Make sure it is enabled and now you're good to go to complete the setup.</p><p id=\"><a href=\"https://www.youtube.com/watch?v=XOaRBr8hOg4\" id=\">Here is a video-tutorial to show it visually!</a></p><p id=\">That is it for the basic setup of your Android device 🥳</p><h2 id=\">Link LastPass Authenticator App to GitHub Account</h2>\n\n<p id=\">You have to link your two-factor authentication of GitHub with your LastPass Authenticator app. Hop over to <a href=\"https://github.com/\" id=\">GitHub.com</a> and you should see your personal page after logging in. Then click on the avatar on the right top, go to <em id=\">Settings</em>, <em id=\">Password and Authentication</em> and there you should be able to enable the two-factor authentication by following the instructions steps.</p><p id=\">You should end up with something like this in your app:</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:880px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"880px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b6dc3cb7acca94ea03_63c55af86b9814b636ade869_ry0nzi8zdxahj4jqszd0.jpeg\" alt=\"LastPass Authenticator App with connected Github.\" id=\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><p id=\">And that's it! You're good to go and can start implementing the automation for AskUI 😎</p><h2 id=\">Implement the Automation of 2-Factor Authentication with AskUI</h2>\n\n<p id=\"><em id=\">If you want to follow along, clone </em><a href=\"https://github.com/askui/flutter-example-automation\" id=\"><em id=\">our GitHub repository</em></a><em id=\">.</em></p><p id=\">If you followed the <a href=\"https://docs.askui.com/docs/next/general/Executing%20Automations/mobile-automation\" id=\">tutorial for setting up the ADB</a>, you should also have the <em id=\">ADBKeyboard</em> in version 2.1 installed.</p><p id=\">Once you have everything set up, head over to your preferred IDE, open a terminal, and type in adb devices. You should see your device successfully connected if you connected it to your PC.</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:496px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"496px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b6dc3cb7acca94ea06_63c55b1bd06f102d7e887683_wcyu5gx2nl677u6w9rbv.jpeg\" alt=\"Terminal output of the command raw `adb devices` endraw .\" id=\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h3 id=\">Setup AskUI</h3>\n\n<p id=\">Please follow along the specific tutorial for your operating system and come back once you set that up:</p>\n\n<ul id=\"><li id=\"><a href=\"https://docs.askui.com/docs/next/general/Getting%20Started/Installing%20AskUI/getting-started\" id=\">Windows</a></li><li id=\"><a href=\"https://docs.askui.com/docs/next/general/Getting%20Started/Installing%20AskUI/getting-started-macos\" id=\">macOS</a></li><li id=\"><a href=\"https://docs.askui.com/docs/next/general/Getting%20Started/Installing%20AskUI/getting-started-linux\" id=\">Linux</a></li></ul><h3 id=\">Setup the UI Controllers - One for your System and one for your Android Device</h3>\n\n<p id=\">We need two UI controllers, one for the Android device and one for our browser on our PC.</p><pre></pre><p id=\">We'll also need to start the UI controllers manually. They'll expose their service on a specific port:</p>\n\n<ul id=\"><li id=\">For the browser 7007</li><li id=\">For the Android device 6769</li></ul>\n\n<p id=\">Start the AskUI Controller for your Android device by running:</p><pre></pre><p id=\">Then start your browser AskUI Controller by running:</p><pre></pre><p id=\">You must first insert your Github-Username on <em id=\">line 9</em> and your password on <em id=\">line 19</em> of the <strong id=\"><em id=\">my-first-askui-test-suite.test.ts</em></strong> file</p><p id=\">Execute the test by running:</p><pre></pre><h2 id=\">Breaking Down the AskUI Code</h2>\n\n<p id=\">We start by importing the UiControlClients for our browser and our Android device.</p><p id=\">Then, we have the basic jest structure which describes a test suit, and then the test case.</p><pre></pre><h3 id=\">Fill Out the Initial Login Form</h3>\n\n<p id=\">Line 1: The first instruction is to click on the browser again to get the focus when we start our automation.</p><p id=\">Line 2: Then we want to click on <strong id=\">Sign In</strong> to bring up the login form from GitHub.</p><p id=\">Line 4-10: Next, we want to type in our username into the text field that is below the text field with the label “username or email address”. Notice how we use { isSecret: true, secretMask: '**' } here, so no sensitive information is sent to the AskUI backend.</p><p id=\">Line 12: Then press <strong id=\">ESC</strong> to lose the focus of the text field and select the password field.</p><p id=\">Line 14-20: We want to type in our password into the text field that is below the text field with the label <strong id=\">Password</strong>.</p><p id=\">Line 22-23: Then we want to <strong id=\">TAB</strong> to get focus on our login button and press enter.</p><p id=\">This is where the browser automation stops and we have to switch to our Android device.</p><pre></pre><h3 id=\">Get a Token from LastPass Authenticator App</h3>\n\n<p id=\">Line 1: We use our Android key here to wake up the tablet if it has gone to sleep.</p><p id=\">Line 4: Then we want to start the LastPass Authenticator App. Starting it over the UI is not too intuitive to automate. For the sake of brevity, we use <strong id=\"><em id=\">execOnShell()</em></strong> with the ADB. That's a little bit of a trick here 😉.</p><p id=\">Line 6-15: The text that displays our token is the first element below the <strong id=\">GitHub</strong> text. We want to copy it and then paste it into the input field that comes up when we do the browser automation.</p><p id=\">Line 18-24: To get the element, we're going to sort the elements based on the bounding box's <em id=\">ymin</em>-coordinate. This should give us the token as the first element. We can take the first element and get its text, replacing all the new lines or spaces we find.</p><pre></pre><h3 id=\">Type the Token Into the Authentication Form</h3>\n\n<p id=\">We then type the token into the input field which contains the text <strong id=\">XXXXXX</strong>.<br>If the token is correct this should bring us to our personal page on GitHub 💃🏻.</p><pre></pre><h2 id=\">Conclusion</h2>\n\n<p id=\">In this tutorial, you learned how to instrument two different devices on two different platforms with AskUI in one automation case.</p><p id=\">With this knowledge, you can now start to write your own cross-platform automation 😎.</p>",
  "category": "Tutorial",
  "readTime": "5 min read",
  "date": "2024-11-11",
  "publishedAt": "Mon Nov 11 2024 11:21:05 GMT+0000 (Coordinated Universal Time)",
  "author": "johannes-dienst",
  "image": "https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b5dc3cb7acca94e845_63c559bcd4a4c380bf4a9930_pexels-photomix-company-887751.jpeg",
  "featured": false,
  "contentPath": "automate-github-2-factor-authentication-with-android-device.md"
}