{
  "id": "better_askui_workflows_with_convenience_methods_in",
  "slug": "better-askui-workflows-with-convenience-methods-in-askui-sdk-adk",
  "title": "Better AskUI Workflows with Convenience Methods in AskUI SDK (ADK)",
  "excerpt": "AskUI interacts with your operating system like a real human user. This directly leads to code that specifies WHAT you have to do in a specific se....",
  "content": "<p id=\">AskUI interacts with your operating system like a real human user. You write code that directly translates to user interactions such as keypresses and mouse clicks.<br></p><p id=\">This directly leads to code that specifies <strong id=\">WHAT</strong> you have to do in a specific sequence to achieve a workflow.<br></p><p id=\">Unfortunately this also means a lot of repetitive code. For example, if you need to navigate a form with keypresses you have to press the key <em id=\">TAB</em> often and sometimes repeatedly.<br></p><p id=\">This is why we implemented some convenience methods to help you ease these pain points.<br></p><p id=\">In this blog we introduce the currently implemented convenience methods and where to use them. Have fun! <br></p><p id=\"><em id=\">Note: Please send us a message if you have an idea for another useful convenience method! TODO Needs a contact mail</em></p><h2 id=\"><strong id=\">clickButton()</strong><br></h2><p id=\"><strong id=\">What it does:</strong> Clicks a button that has a text on it. <br></p><p id=\"><strong id=\">What does it solve:</strong> More concise code for clicking a button.<br></p><p id=\">Example code:</p><pre></pre><h2 id=\"><strong id=\">clickIcon()</strong><br></h2><p id=\"><strong id=\">What it does:</strong> Clicks an icon that matches a description.<br></p><p id=\"><strong id=\">What does it solve:</strong> More concise code for clicking an icon matched by a description.<br></p><p id=\">Example code:</p><pre></pre><h2 id=\"><strong id=\">clickText()</strong></h2><p id=\"><strong id=\">What it does:</strong> Clicks a text. <br></p><p id=\"><strong id=\">What does it solve: </strong>More concise code for clicking a specific text.<br></p><p id=\">Example code:</p><pre></pre><h2 id=\"><strong id=\">clickTextField()</strong></h2><p id=\"><strong id=\">What it does: </strong>Clicks a textfield with a specific placeholder text. <br></p><p id=\"><strong id=\">What does it solve:</strong> More concise code for clicking a textfield identified with a placeholder text.<br></p><p id=\">Example code:</p><pre></pre><h2 id=\"><strong id=\">clickTexts()</strong></h2><p id=\"><strong id=\">What it does: </strong>Searches for text elements and clicks them one after another when found.<br></p><p id=\"><strong id=\">What does it solve:</strong> Reduces the amount of repetitive code.<br></p><p id=\">Example code:</p><pre></pre><h2 id=\"><strong id=\">pressKeyNTimes()</strong></h2><p id=\"><strong id=\">What it does:</strong> Press a key multiple times. At least two times.<br></p><p id=\"><strong id=\">What does it solve:</strong> Reduces the amount of repetitive code. It lets you navigate by keyboard in a concise way. <br></p><p id=\">Example code:</p><pre></pre><h2 id=\"><strong id=\">pressKeys()</strong></h2><p id=\"><strong id=\">What it does:</strong> Press an array of keys one after another.<br></p><p id=\"><strong id=\">What does it solve:</strong> Navigate by keypresses sequences instead of using `pressKey(...)` multiple times.<br></p><p id=\">Example code:</p><pre></pre><h2 id=\"><strong id=\">waitUntil()</strong></h2><p id=\"><strong id=\">What it does: </strong>Wait until an AskUICommand does not fail.<br></p><p id=\"><strong id=\">What does it solve:</strong> Reduces boilerplate code you had to implement in order to wait for an element to become visible.<br></p><p id=\">Example code:</p><pre></pre><p id=\"><strong id=\">Conclusion</strong></p><p id=\">The convenience methods presented here help you keep your AskUI workflows cleaner and more maintainable by reducing repetitive code.<br></p><p id=\">They also make it easier to understand what is going on in your workflows.<br></p><p id=\">Please let us know if you find them useful or if you need a convenience method for a specific purpose.</p>",
  "category": "Academy",
  "readTime": "2 min read",
  "date": "2024-11-11",
  "publishedAt": "Mon Nov 11 2024 11:23:48 GMT+0000 (Coordinated Universal Time)",
  "author": "johannes-dienst",
  "image": "https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/66fd2985f969f94698779bca_cover-better-askui-workflows-with-convenience-methods.png",
  "featured": false
}