{
  "id": "challenges_in_user_interface_automation_the_future",
  "slug": "challenges-in-user-interface-automation-the-future-is-now",
  "title": "Challenges in User Interface Automation: The Future is Now",
  "excerpt": "In this last blog, we look at cutting-edge and future technologies that promise to solve UI Automation for user interfaces that are currently hard....",
  "content": "<p id=\">In the previous two installments (<a href=\"https://www.askui.com/blog-posts/challenges-in-user-interface-automation-current-state\" id=\">link to Part 1</a>, <a href=\"https://www.askui.com/blog-posts/challenges-in-user-interface-automation-new-approaches\" id=\">link to Part 2</a>) of the series, we discussed how the state-of-the-art selector-based approaches to User Interface (UI) Automation can be enhanced with <em id=\">Smart Selectors</em>. They remedy the flakiness of tests by working on relations of UI Elements, finding UI Elements with Optical Character Recognition, or Picture-in-Picture search.</p><p id=\">In this last blog, we look at cutting-edge and future technologies that promise to solve UI Automation for user interfaces that are currently hard to test without a special setup.</p><h2 id=\">The Problem with 2D Planes</h2><p id=\">There is a whole class of applications selector-based tools are unable to test: 2D planes!</p><p id=\">In HTML for example you can define a canvas where selector-based tools can not get any of the elements drawn into them.</p><pre></pre><h2 id=\">Adoption of Cross-Platform Development</h2><p id=\">Native apps for Android and iOS are the preferred way to deliver a product to end users as they can efficiently leverage all the platform-specific APIs. The downside is, that you need specialized development teams to develop the apps. Development on each platform is completely different. This leads to additional costs!</p><p id=\">A solution to this problem is cross-platform development, where only one codebase is maintained that compiles to every platform. In fact, cross-platform development is picking up momentum currently with Flutter leading the way.</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:602px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"602px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b6c4a7de9e545d5c01_6346b27087b6fa11b8a679b3_Flutter_vs_React_SO_Question.png\" loading=\"lazy\" alt=\"Percentage of Stack Overflow questions for React and Flutter\" id=\" width=\"auto\" height=\"auto\"></div></figure><p id=\">Flutters claim on its webpage promises nothing less than</p><blockquote id=\">[...] to build apps for mobile, web, desktop, and embedded devices — all from a single codebase.</blockquote><p id=\">With a single codebase for every platform, the need for multiple development teams is not given anymore.</p><p id=\">But how do you test on Android, iOS, and embedded Devices where selector-based approaches fall short?</p><p id=\">👁 Let us look at what cutting-edge tools are out there already. 👁 </p><h2 id=\">Visual (Regression) Testing aided by Machine Learning/Artificial Intelligence</h2><p id=\">Visual Testing uses screenshots to compare the current state of an app to the specified one. The goal is to find differences in the User Interface like wrong layouts or different colors of elements. Changes like a wrong color of a button can be detected with this technique:</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1205px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1205px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b6c4a7de9e545d5bf4_6346b2e9c3a3b99b48cf3b85_visual_regression_testing_login_form.png\" loading=\"lazy\" alt=\"Visual Regression Testing notices the change in color of the Login button.\" id=\" width=\"auto\" height=\"auto\"></div><figcaption id=\">Visual Regression Testing notices the change in color of the Login button.</figcaption></figure><p id=\">The problem with classic visual (regression) testing tools is that they are very rigid and react to tiny pixel changes. This makes them hard to use in real-world settings as the tests become flaky.</p><p id=\">With the help of Machine Learning and AI, tools like <em id=\">Applitools</em> are trying to get rid of that problem. Applitools trained their model <em id=\">Applitools Eyes</em> to not match pixel-perfect but based on an understanding of the layout. It recognizes differences in the layout like missing elements.</p><p id=\">With its <em id=\">Visual Selectors</em> you can also add custom elements you have in your layout like icons.</p><h2 id=\">Real Visual Testing with Machine Learning</h2><p id=\"><em id=\">Real</em> Visual Testing takes this concept one step further by automating the User Interface as a real human user would. It uses Machine Learning to detect elements on a <em id=\">visual basis</em>. Also, the user input happens on an operating system basis allowing for real mouse movement, clicks/taps, and keystrokes.</p><p id=\">That enables testing all applications on all platforms and across all user interfaces. Furthermore, a test can easily detect bugs for example that stem from modal dialogs or banners that cover other elements.</p><p id=\">What would a model interfere from our rudimentary example page? Let us find out with <a href=\"https://www.askui.com/\" id=\">askui</a>:</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:705px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"705px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b6c4a7de9e545d5bfe_6346b335da853a3de554d4af_askui_login_form_annotation.png\" loading=\"lazy\" alt=\"Annotated webpage showing textfield with label Username and Login button.\" id=\" width=\"auto\" height=\"auto\"></div></figure><p id=\">Now we will try to write something into the text field:</p><pre></pre><p id=\">When you run the code above you will see the mouse moving to the text field and type in <em id=\">askui</em>.</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:795px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"795px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b6c4a7de9e545d5bfb_6346b371ba19716b0cdb5f8a_Kapture%25202022-10-11%2520at%252016.06.59.gif\" loading=\"lazy\" alt=\"Gif showing how the mouse moves to the textfield and typing in askui when the test gets executed.\" id=\" width=\"auto\" height=\"auto\"></div></figure><p id=\">If you want to try it out for yourself feel free to clone the <a href=\"https://github.com/JohannesDienst-askui/challenges-in-ui-automation-article\" id=\">Git repository</a> and check the <a href=\"https://docs.askui.com/docs/general/Introduction/why-askui\" id=\">askui docs</a> for a complete introduction.</p><h2 id=\">Outlook</h2><p id=\">Using Artificial Intelligence to detect elements will only be the beginning. We already see a rise in applications for advanced use cases. Two of which we want to discuss here.</p><h3 id=\">Visual Question Answering</h3><p id=\">A human brain is a pattern-matching machine and can detect the slight difference in the following two pictures easily:</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1015px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1015px\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b6c4a7de9e545d5c04_6346b38d8bc48d1fadba308f_visual_question_answering_only_pictures.png\" loading=\"lazy\" alt=\"Girl walking and a bike nearby vs a girl walking a bike.\" id=\" width=\"auto\" height=\"auto\"></div></figure><p id=\">Machine Learning models usually can detect the triple _&lt; girl, walking, bike &gt;_ but are not able to distinguish between a girl walking a bike and a girl walking with a bike in the same picture.</p><p id=\">But they get better and better and when they can do it reliably even more powerful selectors can be used in UI automation.</p><h3 id=\">Natural Language Processing</h3><p id=\">This development is already at the breakthrough point with models able to generate beautiful art from prompts and systems like GitHub Copilot suggesting code on the fly.</p><p id=\">For UI Automation it will mean a shift away from creating workflows and code execution to writing down what should be done. The tools will figure out a way to do it!</p><h2 id=\">Conclusion</h2><p id=\">In this series, we showed the current state of User Interface automation. We discussed its shortcomings and how to mitigate them.</p><p id=\">Then we went on to advanced techniques like Self-healing Tests which often use Smart Selectors in form of OCR, Picture-in-Picture search, and relational selectors. Especially relational selectors remedy the structural coupling of automation code to the code under test.</p><p id=\">The future of UI Testing is looking bright with emerging tools tackling the problems of current selector-based tools. Bringing Machine Learning and Artificial Intelligence to Visual (Regression) Testing becomes feasible with tools like <em id=\">Applitools Eyes</em>.</p><p id=\"><em id=\">Real</em> Visual Testing solely relies on Machine Learning to detect elements as a human would. It also combines interacting with the UI like a real user, simulating mouse movement and keystrokes. We showed how <a href=\"https://www.askui.com/\" id=\">askui</a> can do exactly that!</p><p id=\"><a href=\"https://askui.circle.so/getting-started\">Do you want to know more about UI automation's future with askui? Join our community!</a></p>",
  "category": "Academy",
  "readTime": "4 min read",
  "date": "2024-11-11",
  "publishedAt": "Mon Nov 11 2024 11:21:29 GMT+0000 (Coordinated Universal Time)",
  "author": "johannes-dienst",
  "image": "https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/671a084e6d6e0c332eeaab3b_thefutureisnow.webp",
  "featured": false
}