{
  "id": "common_terms_in_computer_vision",
  "slug": "common-terms-in-computer-vision",
  "title": "Common Terms in Computer Vision",
  "excerpt": "When you read about Artificial Intelligence, Machine Learning and Computer Vision you often come across terms that seem to be common. But do you k....",
  "content": "<p id=\">When you read about Artificial Intelligence, Machine Learning and Computer Vision you often come across terms that seem to be common.<br></p><p id=\">But do you know all of them and what they actually mean?<br></p><p id=\">In this blog we will list the most common terms that we use in our day-to-day work.</p>\n\n<div data-rt-embed-type='true'><div class=\"footer-cta_container\"> <div class=\"footer-cta_content\"> <h3 class=\"heading-medium text-align-center-mobile\"> What can be said <span class=\"text-style-italic\">can be solved with AskUI.</span> </h3> <a href=\"http://app.askui.com/selfserve-signup-form\" target=\"_blank\" class=\"footer-cta_button w-button\" style=\"color:rgb(186, 255, 73\">Sign up</a> </div> </div></div>\n\n<h2 id=\">Bounding Box</h2>\n\n<p id=\">A <em id=\">Bounding Box</em> is a rectangle around a detected element or region in a picture. In code they are represented with their coordinates. There are different formats used. Some examples:</p>\n\n<ul id=\"><li id=\"><code id=\">pascal_voc</code>: [xmin, ymin, ymax, ymax]</li><li id=\"><code id=\">coco</code>: [xmin, ymin, width, height]</li><li id=\"><code id=\">yolo</code>: normalized [xcenter, ycenter, width, height]</li></ul>\n\n<p id=\">Example in JSON:</p><pre></pre><h2 id=\">Annotation</h2>\n\n<p id=\">An annotation can be the visual representation of a bounding box or just a keypoint. But also a textual description is possible.</p><p id=\">Usually bounding boxes are used in <em id=\">grounding</em> together with <em id=\">labels</em> and to establish a ground-truth or reference for trainingdata and testdata for training computer vision models.</p><p id=\">Annotations differ from labels in that they can include any additional metadata.</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b8c39f787e903e85f8_659183a516ca683d432ef143_1*00p-__SbrNDQPl8-RSSMqQ.png\" loading=\"lazy\" alt=\"Annotation with labels on a website with a lot of text.\" width=\"auto\" height=\"auto\" id=\"></div></figure><h2 id=\">Label</h2>\n\n<p id=\">A label is given to a bounding box or a keypoint and identifies which class or category an object or area the model assigned to it. In the above example the <code id=\">person</code>-text above the bounding box is a label.</p><p id=\">Labels are also used to train models where the training set consists of correctly labeled images.</p><h2 id=\">Image Classification</h2>\n\n<p id=\">Image classification is used to put a predefined label on an image.</p><p id=\">For an image of a cat would get the label <em id=\">cat</em>, while the image of a sunset would get the label <em id=\">sunset</em>.</p><p id=\">This seems like a trivial thing to do but it actually has a lot of practical use cases:</p>\n\n<ul id=\"><li id=\">Recognition of objects or entities depicted in images</li><li id=\">Classifying medical image for detecting abnormalities</li><li id=\">Image retrieval based on categories</li></ul><h2 id=\">Image Segmentation</h2>\n\n<p id=\">The goal of image segmentation is to divide an image into areas that belong together. The areas are visually distinctive from each other.</p><p id=\">The output of the process is a set of segmentation masks that can be used to process the image further.</p><p id=\">Take this segmentation of an avatar image where the masks define where a person is and where the background is. A practical application would be to remove the background based on these masks.</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/66fd2d6dc30e9aa1ff07bd11_666966ad5d097c148e7572e1_segment-anything-demo.png\" loading=\"lazy\" alt=\"Colored segmentation areas for an avatar image.\" width=\"auto\" height=\"auto\" id=\"></div></figure><h2 id=\">Object Detection</h2>\n\n<p id=\">Object detection is used to identify objects in images and video. It is a crucial task in a lot of domains such as Surveillance and Security, Environmental Monitoring and Augmented Reality.</p><p id=\">It takes visual input and determines the objects that are present. The objects are described with a bounding box and also get a class-label and sometimes a confidence score.</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/66fd2d6dc30e9aa1ff07bcf2_666966c257c5f662e5091033_object-detection-example.png\" loading=\"lazy\" alt=\"Detected objects are person and cell phone in a screenshot of a person sitting in a chair holding up a cell phone.\" width=\"auto\" height=\"auto\" id=\"></div></figure><h2 id=\">Feature</h2>\n\n<p id=\">A distinctive feature in an area or keypoint of an image. Usually you attribute features to a specific class you want to detect.</p><p id=\">For a <strong id=\">mouse</strong> those could be the shape, surroundings or fur pattern. Those are represented as numerical vectors, called descriptors, that capture the visual properties of an area or keypoint.</p><h2 id=\">Feature Vector</h2>\n\n<p id=\">Feature vectors are not limited to Computer Vision, but used there for all kind of tasks.</p><p id=\">A feature vector is generated from input data such as an image and contains one numerical entry for every feature. Feature vectors are typically high-dimensional.</p><p id=\">In practice feature vectors get generated by a <em id=\">Backbone</em> (see next heading) which are by themselves models trained to extract useful features.</p><h2 id=\">Grounding</h2>\n\n<p id=\"><em id=\">Grounding</em> is the process of connecting high-level concepts, for example <strong id=\">Mouse</strong>, with visual features, for example <strong id=\">tail</strong>.</p><p id=\">Now that you have high-level concepts and their representation in the model you can also put them into context and relation with each-other.</p><p id=\">Grounding can also be done by humans for training data. There you annotate an input with bounding boxes and labels, so the model has a <em id=\">Ground Truth</em> to learn from.</p><h2 id=\">Referring Expression</h2>\n\n<p id=\">Referring Expression in Computer Vision are used to describe objects or areas in images. They can contain attributes like color or relations to other objects.</p><p id=\">Take this example: \"The bike next to the child.\" You do not point to the bike directly but give a reference point <em id=\">child</em>. Or you could give a description: \"The red building next to the blue car.\".</p><p id=\">Referring Expressions are typically used in tasks like object localization, object detection or image retrieval.</p><h2 id=\">Zero-Shot</h2>\n\n<p id=\">In general <em id=\">zero-shot</em> is when models can do tasks they were not specifically trained on.</p><p id=\">To some extend, and most of them rather poorly, every model can perform tasks without specific training as the goal of training is to get a higher-level understanding of concepts.</p><p id=\"><em id=\">Zero-shot</em> learning in Computer Vision also includes more information than just labeled examples. The focus is on data that describes relationships between categories, so the model can generalize better to new categories.</p><p id=\">This also requires large scale training on a lot of data, so the model is exposed to billions of examples and can generalize without specific training to new tasks.</p><h2 id=\">Conclusion</h2>\n\n<p id=\">That are all, but sure there are more. Do you know of any we should include?</p><p id=\">Let us know on <a href=\"https://www.linkedin.com/company/askyourui\" id=\">Social Media</a>.</p>",
  "category": "Academy",
  "readTime": "4 min read",
  "date": "2024-11-11",
  "publishedAt": "Mon Nov 11 2024 11:20:21 GMT+0000 (Coordinated Universal Time)",
  "author": "Johannes Dienst",
  "image": "https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/671a53b3f0ff64cf35fc7312_commontermsincomputervision.webp",
  "featured": false,
  "contentPath": "common-terms-in-computer-vision.md"
}