{
  "id": "getting_started_with_askui",
  "slug": "getting-started-with-askui",
  "title": "Getting Started With AskUI for UI Automation",
  "excerpt": "AskUI is a platform-independent, visual selector-based UI automation framework. Learn how to get started!",
  "content": "<p id=\">Test automation is still considered a bottleneck in modern software development. Especially User Interface (UI) automation can be quite challenging in certain cases. Despite countless frameworks and tools, it is very difficult to automate applications across operating systems, although cross-platform workflows play an increasingly important role. For example, testing a 2-factor authentication of a web application via smartphone is almost impossible to automate as an end-to-end process.</p><p id=\">AskUI closes this gap by rethinking UI automation.</p><h2 id=\">About AskUI</h2>\n\n<p id=\">AskUI is a platform-independent, visual selector based UI automation framework. Instead of controlling elements via selectors such as <em id=\">XPath</em> or <em id=\">CSS</em> selectors and thus being limited to web applications, AskUI controls the UI at the operating system level while also detecting elements with AI vision models.</p><p id=\">For making this possible, a neural network was trained on the appearance of UI elements in order to localize UI elements based on screenshots. These are then matched with an instruction that is unique for the respective element. The final execution of the instruction happens via mouse and keyboard control on the operating system. Such an instruction could be for example:</p><pre></pre><p id=\">If we take a look at the corresponding UI, it becomes clear which action is to be executed:</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1b9c39f787e903e86af_631f00a03e31e3e9503a3a5f_2jhpm80ee9urmzzwocq8.png\" alt=\"Image description\" width=\"auto\" height=\"auto\" loading=\"auto\" id=\"></div><figcaption id=\">Example Login page</figcaption></figure><p id=\">The instruction describes a click on a button below a certain text, in this case <em id=\">Password</em>. Visually, there is only one button here, so when the action is executed, a click on the blue <em id=\">Login</em> button is performed.</p><h2 id=\">Why AskUI</h2>\n\n<p id=\">In principle, one can of course ask whether another test automation tool is needed after Selenium, Playwright and co. If you look at the development of the last few years, you will notice that websites and apps are using more and more new technologies, e.g. <a href=\"https://www.w3schools.com/tags/tag_iframe.asp\" id=\">iFrame</a> or <a href=\"https://glazkov.com/2011/01/14/what-the-heck-is-shadow-dom/\" id=\">ShadowDOM</a>, and third-party systems, which make it more difficult to automate them. Instead of developing a separate automation solution for each new technology, AskUI acts independently of these developments and acts as a future-proof framework for UI automation of any operating system. The following advantages result from the approach:</p>\n\n<ul id=\"><li id=\">Test instructions are written in <em id=\">UI language</em> and are thus easy to understand.</li><li id=\">No access to code selectors is needed. Thus the tests are independent of changes in the program code and run very stable.</li><li id=\">Elements are found visually by an AI vision model and not by pixel-matching. This makes the automation completely independent of the resolution and design of the UI elements.</li></ul>\n\n<p id=\">In the following, we will take a look at the first steps in AskUI.</p><h2 id=\">Setting up AskUI</h2>\n\n<p id=\">AskUI is an <a href=\"https://github.com/askui/askui\" id=\">open source framework </a>with a public <a href=\"https://docs.askui.com/\" id=\">documentation</a>. You need to <a href=\"http://app.askui.com/selfserve-signup-form\" id=\">create an account </a>and get 500 Steps per month free for our AskUI inference backend. That is enough to get a feel for AskUI and automate a small test or workflow.</p><h3 id=\">Download and Run The Installer</h3>\n\n<p id=\">The first thing you have to do is to download the installer which will install the following main components:</p>\n\n<ul id=\"><li id=\">AskUI Development Environment (ADE) - Manages you AskUI Installation and Settings as well as the...</li><li id=\">AskUI Controller - Service that executes user actions on your behalf like mousemovement/-clicks and keyboard presses.</li></ul><h4 id=\">Windows</h4>\n\n<p id=\">Download the installer from this link and run it:</p>\n\n<ul id=\"><li id=\"><a href=\"https://files.askui.com/releases/Installer/24.9.1/AskUI-Suite-24.9.1-Installer-Win-AMD64-Full.exe\" id=\">AMD64 architecture</a></li><li id=\"><a href=\"https://files.askui.com/releases/Installer/24.9.1/AskUI-Suite-24.9.1-Installer-Win-ARM64-Full.exe\" id=\">ARM64 architecture</a></li></ul><h4 id=\">macOS</h4>\n\n<p id=\">Run the following command in a terminal:</p><pre></pre><h4 id=\">Linux</h4>\n\n<p id=\">Download the correct installer for your architecture:</p><pre></pre><p id=\">Now, we are ready to create our first AskUI project with the AskUI&nbsp;Development Environment (ADE)</p><h2 id=\">Create an AskUI Project with the ADE</h2>\n\n<p id=\">Open a terminal of your choosing -we recommend the one inside Visual Studio Code- and activate the ADE by running the following command:</p><pre></pre><p id=\">Before you can create a new project, please set your AskUI&nbsp;Credentials:</p><pre></pre><p id=\">Then you can create your first project by running the following command:</p><pre></pre><p id=\">Open the project you just created with a code editor/IDE like Visual Studio code. It should look like this:</p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/66fbdcf975ba856290cf8c11_66fbda2747def3302a85c34d_Screenshot%25202024-10-01%2520at%252013.15.51.png\" loading=\"lazy\" alt=\"Visual Studio code opened with freshly setup AskUI project.\" width=\"auto\" height=\"auto\" id=\"></div></figure><p id=\">‍<br></p><h2 id=\">Running Your First Test</h2>\n\n<p id=\">We will just focus on the file <em id=\">askui_example/my-first-askui-test-suite.test.ts</em> for now. This file includes your first example test which should look like this:</p><pre></pre><p id=\">This test is going to create an annotation of your <strong id=\">main </strong>screen after executing in the folder. But before we execute it, we want to make sure it will do something trivial on your screen: <em id=\">Clicking a random text</em>. Change it to the following:</p><pre></pre><p id=\">We are nearly there. One last thing is left to check: Is the AskUI Controller running on your <strong id=\">main</strong> display? Check it by running the following command:</p><pre></pre><p id=\">If you get the message <strong id=\"><em id=\">No AskUI Controller was started with the help of the AskUI-StartController command during this session.</em></strong> You can start it with the following command:</p><pre></pre><p id=\">Now we are ready to execute our first test. Therefore, we type the following command in the terminal:</p><blockquote id=\">AskUI-RunProject</blockquote><p id=\">You should now see the test suite being executed inside the shell and, actually, your cursor should move to some text shown on your screen and click on that text. 🎉 Congratulations! You just executed your first test suite using askui.</p><blockquote id=\">Tip: If you want to see what the AI model detects on your screen, use the <em id=\">annotateInteractively</em> (see <a href=\"https://docs.askui.com/docs/0.7.2/general/Tooling/annotation\" target=\"_blank\" id=\">here</a>) command. It will create an overlay where you can check all detected UI elements and their classification.</blockquote><h2 id=\">A More Detailed Getting Started</h2>\n\n<p id=\"><a href=\"https://docs.askui.com/docs/general/Getting%20Started/write-your-first-instruction\" id=\">Check out our Getting Started in the Docs for a more extensive example </a>and pointers to what you can do with AskUI.</p>",
  "category": "Tutorial",
  "readTime": "4 min read",
  "date": "2024-11-11",
  "publishedAt": "Mon Nov 11 2024 11:17:16 GMT+0000 (Coordinated Universal Time)",
  "author": "Jonas Menesklou",
  "image": "https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/671a2fe9384e30b820a20016_gettingstarted.webp",
  "featured": false,
  "contentPath": "getting-started-with-askui.md"
}