{
  "id": "integrating_video_recording_and_custom_reporters_i",
  "slug": "integrating-video-recording-and-custom-reporters-into-askui-runs",
  "title": "Integrating Video Recording and Custom Reporters into AskUI Runs",
  "excerpt": "Debugging UI-Automations can be a real pain especially when you run them inside a Pipeline with no chance to observe what is actually happening during",
  "content": "<p id=\">Debugging UI-Automations can be a real pain especially when you run them inside a pipeline with no chance to observe what is actually happening during execution.<br></p><p id=\">Wouldn't it be nice to get a report of failed automation steps that include screenshot before and after an execution and also a video?<br></p><p id=\">We've recently added video recording support to our UI controller, enabling you to record a video for each step you execute and add it to a report of your AskUI runs. <br></p><p id=\">We also provide an interface you can implement so you can integrate it into your favorite reporting tool like for example Allure.</p><h2 id=\"><strong id=\">Implementing A Reporter</strong></h2><p id=\">To help you get started, we've created an <a href=\"https://github.com/askui/askui-example-allure-reporter\" id=\">example repository for Allure</a> and also a <a href=\"https://github.com/askui/askui-reporters\" id=\">repository where we collect reporter implementations</a>.<br></p><p id=\">Implementing your own reporter involves two main steps:</p><ol start=\" id=\"><li id=\">Implementing the reporter interface </li><li id=\">Configuring the reporter within the <strong id=\">askui-helper.ts</strong>.<br></li></ol><p id=\">Depending on your chosen reporter framework, you may not need to implement every function in the interface. </p><pre></pre><p id=\">For instance, our Allure reporter only includes the config and <strong id=\">onStepEnd()</strong> functions. </p><pre></pre><p id=\">Optionally, you can provide mappings for the steps of <strong id=\">__Jest__</strong> to your reporter framework, tailoring the integration to your preferences.<br></p><p id=\">To integrate video recording into your reporting tool, configure your reporter in the <strong id=\">askui-helper.ts</strong> file within the <strong id=\">UIControlClient</strong>. Additionally, extract the recorded video from the <strong id=\">UIController</strong> and add it to your reporter.<br></p><p id=\">Here's an example of how that is done:</p><pre></pre><h2 id=\"><strong id=\">Allure Example</strong></h2><p id=\">Our Allure example repository also publishes its report to a website: <a href=\"https://askui.github.io/askui-example-allure-reporter\" id=\">Check it out here!</a></p><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1bd517c296559afdc3c_649c3d9bf167eb6967537736_allure-report.png\" loading=\"lazy\" id=\" width=\"auto\" height=\"auto\" alt=\"></div><figcaption id=\">Allure dashboard starting page of allure-example-reporter repository](allure-report.png)<br>.</figcaption></figure><p id=\">‍<br></p><h2 id=\"><strong id=\">Links for Already Implemented Reporters</strong><br></h2><p id=\">We've created a community repository on our GitHub space where you can find and contribute implemented reporters. If you need inspiration or want to share your custom reporter with the community this is the right place to start!<br></p><p id=\"><a href=\"https://github.com/askui/askui-reporters\" id=\">All reporters and Instructions to implement your own</a><br></p><h2 id=\"><strong id=\">Conclusion</strong><br></h2><p id=\">Incorporating screenshots and videos into your executed steps reports can significantly enhance your reports, as demonstrated in the provided example.<br></p><p id=\">If a specific reporter is not implemented already, you can implement it on your own and integrate it with the instructions and examples given in our repositories.<br></p><p id=\">If you need help, please join our <a href=\"https://askui.circle.so/getting-started\">Community</a> where the AskUI staff and the community are ready to help you out!</p>",
  "category": "Tutorial",
  "readTime": "2 min read",
  "date": "2024-11-11",
  "publishedAt": "Mon Nov 11 2024 11:14:57 GMT+0000 (Coordinated Universal Time)",
  "author": "johannes-dienst",
  "image": "https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6634d1bc517c296559afdbaa_649c3d4ab1ebf736c1ddf4df_cover.jpeg",
  "featured": false
}