{
  "id": "parallel_execution_of_askui_workflows_with_jest",
  "slug": "parallel-execution-of-askui-workflows-with-jest",
  "title": "Parallel Execution of AskUI Workflows with Jest",
  "excerpt": "Have you ever needed to run your AskUI Workflows in parallel on multiple devices to speed up the execution?",
  "content": "<p id=\">Have you ever needed to run your AskUI Workflows in parallel on multiple devices to speed up the execution?</p><p id=\">That is possible with a little bit of configuration in Jest, the runner used to execute <em id=\">AskUI Workflows</em>, and multiple <em id=\">AskUI Controllers</em>.</p><p id=\">This blog will walk you through the setup for two Android devices and running a bunch of workflows.</p><h2 id=\">Prerequisites</h2><ul id=\"><li id=\">AskUI installed and configured on your system (<a href=\"https://docs.askui.com/docs/general/Getting%20Started/getting-started\" id=\">Windows</a>, <a href=\"https://docs.askui.com/docs/general/Getting%20Started/getting-started-linux\" id=\">Linux</a>, <a href=\"https://docs.askui.com/docs/general/Getting%20Started/getting-started-macos\" id=\">macOS</a>)</li><li id=\"><a href=\"https://github.com/askui/askui-example-android-parallel-devices\" id=\">GitHub repository to follow along</a></li></ul><figure id=\" class=\"w-richtext-figure-type-image w-richtext-align-center\" data-rt-type=\"image\" data-rt-align=\"center\"><div id=\"><img src=\"https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/66b379b84a4981a9c3a8548f_669a8747d3deefbf2a9407d7_askui-architecture.png\" loading=\"lazy\" alt=\"The image is a diagram illustrating the architecture of a system involving a local device and an inference server, connected via a series of processes and data flows. Your Local Device: Contains an Operating System connected to the askui UI Controller through InputEvents. The askui UI Controller communicates with the askui Control Client via ControlCommands. The askui Control Client can send and receive Screenshots and Annotations from the Inference Server. Inference Server: Performs various detection and classification tasks through Object Detection, Icon Classification, Custom Element Detection, and OCR modules. A Fusion module integrates the outputs of these detection and classification tasks. The Fusion module sends back the results to the askui Control Client on the local device. This diagram highlights the interaction between the local device and the inference server for processing and analyzing UI elements and screenshots.\" width=\"auto\" height=\"auto\" id=\"></div></figure><h2 id=\">Start AskUI Controllers</h2><p id=\">⚠️ <em id=\">The commands shown below start the AskUI Controller on your local machine as we are controlling two Android devices. If you want to run your workflows on a remote machine, install and start the controllers there. Do not forget to get the IP of the remote machine for the URL to the controller!</em></p><h3 id=\">Windows<code id=\">‍</code></h3><p id=\"><pre></pre></p><h2 id=\">Jest</h2><p id=\">Next comes Jest, the javascript framework AskUI uses to run its workflows.</p><h3 id=\"><code id=\">.env</code> For Configuration Environment Variables</h3><p id=\">First, we want to have a way to configure how many parallel processes are running workflows. For this, we install the <code id=\">dotenv</code> package like this:</p><p id=\"><pre></pre></p><p id=\">Then we create a file <code id=\">.env</code> in the root of the project and fill it with the following. We set the <code id=\">JEST_MAX_WORKER</code> to two as we have two Android devices:</p><p id=\"><pre></pre></p><h3 id=\">Configure Maximum Parallel Workers in <code id=\">jest.config.ts</code></h3><p id=\">We need the <a href=\"https://jestjs.io/docs/cli#--maxworkersnumstring\" id=\">max workers feature</a> from Jest which allows us to specify the number of workers that should run in parallel. It can be configured in the file <code id=\">jest.config.ts</code>. We use the environment variable <code id=\">JEST_MAX_WORKER</code> from the <code id=\">.env</code> file.</p><p id=\"><pre></pre></p><h3 id=\">Connect AskUI Controllers in <code id=\">askui-helper.ts</code></h3><p id=\">In the <code id=\">askui-helper.ts</code> we hold an array of all AskUI Controller URLs we want to target. We take the configured <code id=\">maxWorkers</code> and the <code id=\">workerId</code> to connect each worker with a different AskUI Controller.</p><p id=\">⚠️ <em id=\">If you do not use two Android devices and the AskUI Controller runs on a remote system, you must change the URLs in the uiControllerDeviceList.</em></p><p id=\"><pre></pre></p><p id=\">When you start your run with this configuration you will see that the <code id=\">*.test.ts</code> files will be executed in parallel and <em id=\">ONLY</em> once. Each worker will generate a separate report, giving you detailed insights into the execution.</p><p id=\">The important thing is that each worker is completely independent and encapsulated. This means the setup process from <code id=\">askui-helper.ts</code> will run separately for each worker! This ensures that the workflows do not interfere with each other.</p><h1 id=\">Conclusion</h1><p id=\">With a little bit of Jest configuration and multiple <em id=\">AskUI Controllers</em> you can parallelize the execution of your AskUI Workflows.</p><p id=\">If you have questions or need support, do not hesitate to join our <a href=\"https://community.askui.com/getting-started\" id=\">Community</a>.</p>",
  "category": "Academy",
  "readTime": "2 min read",
  "date": "2024-11-11",
  "publishedAt": "Mon Nov 11 2024 10:58:14 GMT+0000 (Coordinated Universal Time)",
  "author": "Johannes Dienst",
  "image": "https://cdn.prod.website-files.com/6630f90ff7431b0c5b1bb0e7/6717c12da2813ab34aaf361a_thumbnail_small.webp",
  "featured": false
}